Connected Services/servicioFacturacion2021/billService2.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:wsp200607="http://www.w3.org/2006/07/ws-policy" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:ns0="http://service.gem.factura.comppago.registro.servicio.sunat.gob.pe/" xmlns:ns1="http://service.sunat.gob.pe" xmlns:ns2="http://www.datapower.com/extensions/http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsp200409="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:soap11="http://schemas.xmlsoap.org/wsdl/soap/" targetNamespace="http://www.datapower.com/extensions/http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types />
  <wsdl:binding name="BillServicePortBinding" type="ns1:billService">
    <soap12:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="getStatus">
      <soap12:operation soapAction="urn:getStatus" style="document" soapActionRequired="true" />
      <wsdl:input name="getStatusRequest">
        <soap12:body use="literal" />
      </wsdl:input>
      <wsdl:output name="getStatusResponse">
        <soap12:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="sendBill">
      <soap12:operation soapAction="urn:sendBill" style="document" soapActionRequired="true" />
      <wsdl:input name="sendBillRequest">
        <soap12:body use="literal" />
      </wsdl:input>
      <wsdl:output name="sendBillResponse">
        <soap12:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="sendPack">
      <soap12:operation soapAction="urn:sendPack" style="document" soapActionRequired="true" />
      <wsdl:input name="sendPackRequest">
        <soap12:body use="literal" />
      </wsdl:input>
      <wsdl:output name="sendPackResponse">
        <soap12:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="sendSummary">
      <soap12:operation soapAction="urn:sendSummary" style="document" soapActionRequired="true" />
      <wsdl:input name="sendSummaryRequest">
        <soap12:body use="literal" />
      </wsdl:input>
      <wsdl:output name="sendSummaryResponse">
        <soap12:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
</wsdl:definitions>